In [1]:
pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.11/dist-packages (3.5.5)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.11/dist-packages (from pyspark) (0.10.9.7)

In [24]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import*

# initalize sparkContext
spark = SparkSession.builder.appName("PySpark_Tutorial").getOrCreate()
sc = spark.sparkContext
sc
# reda csv file
print("Sample data")
df=spark.read.csv("/content/sample_data/data1.csv.csv",header=True,inferSchema=True)
df.show(4)


print("Second data")
df1=spark.read.csv("/content/sample_data/data1.csv.csv",header=True,inferSchema=True)
df1.show(4)



# Let's performed the oprations here union and unionAll ,even expcet and interxcpet
print("union")
df.union(df1).show(4)

print("unionAll")
df.unionAll(df1).show(4)

print("intersect")
df.intersect(df1).show(4)

print("subtract")
df.subtract(df1).show(4)

Sample data
+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+
only showing top 4 rows

Second data
+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+
only showing top 4 rows

union
+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+
only showing top 4 rows

unionAll
+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+
only showing top 4 rows

intersect
+---+-----+------+---+------+---------+---------+
| id| name|gender|age|salary|purchased|  country|
+---+-----+------+---+------+---------+---------+
| 22| Emma|Female| 29| 60000|        1|   Canada|
|  4|Emily|Female| 40| 90000|        1|Australia|
|  1| John|  Male| 28| 60000|        3|      USA|
| 24|  Ava|Female| 27| 57000|        2|       UK|
+---+-----+------+---+------+---------+---------+
only showing top 4 rows

subtract
+---+----+------+---+------+---------+-------+
| id|name|gender|age|salary|purchased|country|
+---+----+------+---+------+---------+-------+
+---+----+------+---+------+---------+-------+